МультиПорт/src/InformationRegisters/MultiPort_СостояниеОбъектовОбмена/MultiPort_СостояниеОбъектовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>MultiPort_СостояниеОбъектовОбмена</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.MultiPort_ОбъектыОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнешняяСистема</name>
    <type>
      <types>ExchangePlanRef.MultiPort_ВнешниеСистемы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнтеграционныйПроцесс</name>
    <type>
      <types>CatalogRef.MultiPort_ИнтеграционныеПроцессы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МультиПорт/src/InformationRegisters/MultiPort_СостояниеОбъектовОбмена/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция УстановитьСостояниеОбъектаОбмена(СтруктураЗаписи) Экспорт

	Результат = "";
	
	ПроверяемыеРеквизиты = Новый Массив;
	ПроверяемыеРеквизиты.Добавить("Объект");
	ПроверяемыеРеквизиты.Добавить("ВнешняяСистема");
	
	Для Каждого ПроверяемыйРеквизит Из ПроверяемыеРеквизиты Цикл
		Если СтруктураЗаписи.Свойство(ПроверяемыйРеквизит)
			И Не ЗначениеЗаполнено(СтруктураЗаписи[ПроверяемыйРеквизит]) Тогда
			
			ОписаниеСобытия = НСтр("ru = 'Добавление записи регистра сведений ""Состояние объектов обмена (MultiPort)""'");
			Комментарий     = НСтр("ru = 'Не заполнен реквизит %1. Создание записи регистра невозможно.'");
			Комментарий     = СтрШаблон(Комментарий, ПроверяемыйРеквизит);
			ЗаписьЖурналаРегистрации(ОписаниеСобытия, 
			                         УровеньЖурналаРегистрации.Ошибка,
			                         Метаданные.РегистрыСведений.MultiPort_СостояниеОбъектовОбмена,
			                         ,
			                         Комментарий);
			
			Возврат Комментарий;
			
		КонецЕсли;
	КонецЦикла;	
	
	// Устанавливаем состояние	
	МенеджерЗаписи = РегистрыСведений.MultiPort_СостояниеОбъектовОбмена.СоздатьМенеджерЗаписи(); 
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураЗаписи);
	Если СтруктураЗаписи.Свойство("ДатаСостояния") Тогда
		МенеджерЗаписи.ДатаСостояния = СтруктураЗаписи.ДатаСостояния;
	Иначе
		МенеджерЗаписи.ДатаСостояния = ТекущаяДатаСеанса();
	КонецЕсли;	
	МенеджерЗаписи.Записать();
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
